In [1]:
import tensorflow as tf
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from tensorflow.keras.models import Model
from tensorflow.keras.layers import Dense, Input
from sklearn.model_selection import train_test_split

In [2]:
df = pd.DataFrame({'categorical': ['d','e','f'],
                   'numeric': [1, 2, 3],
                   'object': ['a', 'b', 'c']
                  })
df

  categorical  numeric object
0           d        1      a
1           e        2      b
2           f        3      c

# pandas.DataFrame.describe()
显示所有的统计值

In [3]:
df.describe()

       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

# pandas.DataFrame.pop()
用于删除指定列,并返回删除列

In [4]:
df.pop('categorical')

0    d
1    e
2    f
Name: categorical, dtype: object

In [5]:
df

   numeric object
0        1      a
1        2      b
2        3      c

# df.transpose()
与 df.T一样

In [6]:
df.transpose()

         0  1  2
numeric  1  2  3
object   a  b  c

In [7]:
df.T

         0  1  2
numeric  1  2  3
object   a  b  c

# df.drop_duplicates()

In [8]:
df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

In [9]:
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [10]:
df.drop_duplicates('brand')#根据列索引删除重复的行

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

# pandas.Dataframe(name = '**')

In [11]:
q_table = pd.DataFrame(np.zeros([1,6]))
q_table

     0    1    2    3    4    5
0  0.0  0.0  0.0  0.0  0.0  0.0

In [12]:
q_table = q_table.append(pd.Series([0]*6,index=q_table.columns,name='yes'))
q_table

       0    1    2    3    4    5
0    0.0  0.0  0.0  0.0  0.0  0.0
yes  0.0  0.0  0.0  0.0  0.0  0.0

In [13]:
i = ['*']*6

i

['*', '*', '*', '*', '*', '*']

In [14]:
interface = [i for e in range(6)]

In [15]:
interface

[['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*']]

In [16]:
import copy
list = copy.copy(interface)
list

[['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*'],
 ['*', '*', '*', '*', '*', '*']]

In [17]:
list[-1][-1] = 'T'
list

[['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T']]

In [18]:
import copy

In [19]:
list

[['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T'],
 ['*', '*', '*', '*', '*', 'T']]

In [20]:
for i in list:
    print(''.join(i))

*****T
*****T
*****T
*****T
*****T
*****T

In [21]:
q_table = pd.DataFrame(np.zeros([6,6]))
q_table

     0    1    2    3    4    5
0  0.0  0.0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0  0.0  0.0
4  0.0  0.0  0.0  0.0  0.0  0.0
5  0.0  0.0  0.0  0.0  0.0  0.0

# Dataframe.append

In [22]:
q_table.append(pd.Series([0]*6,index=q_table.columns,name = '66'))

      0    1    2    3    4    5
0   0.0  0.0  0.0  0.0  0.0  0.0
1   0.0  0.0  0.0  0.0  0.0  0.0
2   0.0  0.0  0.0  0.0  0.0  0.0
3   0.0  0.0  0.0  0.0  0.0  0.0
4   0.0  0.0  0.0  0.0  0.0  0.0
5   0.0  0.0  0.0  0.0  0.0  0.0
66  0.0  0.0  0.0  0.0  0.0  0.0

In [23]:
q_table

     0    1    2    3    4    5
0  0.0  0.0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0  0.0  0.0
4  0.0  0.0  0.0  0.0  0.0  0.0
5  0.0  0.0  0.0  0.0  0.0  0.0

In [24]:
q_table = q_table.append(pd.Series(np.zeros([6]),index=q_table.columns,name = '66'))
#对于Dataframe columns是行索引，index是列索引 而Series index是行索引 name是列索引

In [25]:
q_table

      0    1    2    3    4    5
0   0.0  0.0  0.0  0.0  0.0  0.0
1   0.0  0.0  0.0  0.0  0.0  0.0
2   0.0  0.0  0.0  0.0  0.0  0.0
3   0.0  0.0  0.0  0.0  0.0  0.0
4   0.0  0.0  0.0  0.0  0.0  0.0
5   0.0  0.0  0.0  0.0  0.0  0.0
66  0.0  0.0  0.0  0.0  0.0  0.0

#

In [26]:
a = pd.DataFrame(np.zeros([1,6]),index = ['[1,2]'])

In [27]:
a = a.append(pd.Series(np.zeros([6]),index=a.columns, name = '[3,2]'))

In [28]:
b = [1,2]

In [29]:
b = str(b)

In [30]:
b

'[1, 2]'

In [31]:
for i in range(5):
    print(i)

0
1
2
3
4

In [41]:
print('123123\n123123')
print ('\r\b\r345345')

123123
123123
345345

In [2]:
 q_table = pd.read_csv('/Users/zhx/Documents/test_table.csv',index_col=0)

In [3]:
q_table

           right      left      down            up
0       0.000000  0.000000  0.000000  0.000000e+00
1       0.000000  0.000000  0.000000  0.000000e+00
2       0.000000  0.000000  0.000000  0.000000e+00
3       0.000000  0.000000  0.000000  0.000000e+00
4       0.000000  0.000000  0.000000  0.000000e+00
...          ...       ...       ...           ...
[4, 0]  0.000012  0.000002  0.000013  2.834823e-07
[4, 1]  0.000000  0.000002  0.000084  5.441956e-06
[0, 3]  0.000000  0.000000  0.000000  0.000000e+00
[5, 1]  0.000562  0.000015  0.000081  1.267455e-05
[5, 0]  0.000084  0.000015  0.000012  1.830074e-06

[103 rows x 4 columns]